#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage{arxiv}
#+OPTIONS: toc:nil

#+begin_export latex
\newtheorem{theorem}{Theorem}

\title{Parameter Learning in Bayesian Networks under Uncertain Evidence  \textendash  \ An Exploratory Research.}
\author{
  Marco Hassan 	           	\\
  Zurich, CH		\\
  \\
  \\
  Master Thesis \\
  Presented to the Eidgenossische Teschnische Hochschule Zurich \\
  In Fulfillment Of the Requirements for \\ 
  the Master of Science in Statistics \\
  \\
  Supervisor: PhD. Radu Marinescu \\
  Co-Supervisor: Dr. Markus Kalisch \\
  %% examples of more authors
  %% \AND
  %% Coauthor \\
  %% Affiliation \\
  %% Address \\
  %% \texttt{email} \\   
  %% \And
  %% Coauthor \\
  %% Affiliation \\
  %% Address \\
  %% \texttt{email} \\
  %% \And
  %% Coauthor \\
  %% Affiliation \\
  %% Address \\
  %% \texttt{email} \\
}

\begin{article}

\maketitle
#+end_export

\newpage

\tableofcontents
\listoffigures
\listofalgorithms
\listoftables

\newpage

** Bayesian Networks - Formal Definition
   :LOGBOOK:
   CLOCK: [2021-05-21 Fri 16:22]--[2021-05-21 Fri 16:47] =>  0:25
   CLOCK: [2021-05-21 Fri 15:48]--[2021-05-21 Fri 16:13] =>  0:25
   CLOCK: [2021-05-21 Fri 14:18]--[2021-05-21 Fri 14:43] =>  0:25
   :END:

   Before starting to dig into the material we provide a general
   definition of a Bayesian Network as in cite:pearl2011bayesian.

   #+begin_export latex
  \begin{definition}
  Bayesian Network: A Bayesian Network is a directed acyclic graph (DAG) $G(\mathscr{V}, \mathscr{X})$
  whose nodes $\mathscr{X}$ represent random variables in the Bayesian sense - i.e. they can be observable
  quantities, latent variables, unknown parameters or hypotheses. \\
  On the top of it, edges $\mathscr{V}$ represent the conditional dependencies among the nodes; i.e. nodes that
  are not connected represent random variables that are conditionally independent.
  \end{definition}
   #+end_export

   Especially important is the characterization of the conditional
   independence relation among the random variables.

   In order to see this, recall that when modeling a Bayesian Network
   the object of interest is the complete probabilistic model of the
   random variables domain - i.e. the probability of every possible
   event as defined by the values of all of the variables.

   Consider the case where you would want to represent the joint
   distribution of a set of random variables $\mathscr{X} = \{X_1, ...,
   X_n\}$.

   Then, given a parametric distribution on each random variable in
   the set it is possible to extract the functional form of the
   probability distribution for the joint distribution. However, there
   is an issue when trying to directly model the joint distribution
   without explicitly leveraging and modeling the conditional
   independence structures among the random variables. This due to the
   exponential number of possible events in the domain that would
   require an exponential number of parameters. Standard examples may
   be found in cite:koller2009probabilistic.

   Yet when considering the conditional structure among the variables
   in the set $\mathscr{X}$, it is possible to leverage the /global
   semantics/ of the network to represent the joint-distribution in
   compact form cite:pearl2011bayesian:

   #+begin_export latex
   \begin{align*} 
   P (x_1, ..., x_n) = \prod_i P(x_i | pa_i)
   \end{align*}
   #+end_export      

   where $pa_i$ represents the parents nodes of node $x_i$.

   It is then possible to see that as well framed by
   cite:pearl2011bayesian: "Provided that the number of parents of
   each node is bounded, it is then immediate to see that the number
   of parameters required grows only linearly with the size of the
   network, whereas the joint-distribution itself grows
   exponentially."

   This leads us to a second possible definition of Bayesian network
   as framed by cite:koller2009probabilistic, making more concrete the
   idea of a Bayesian Network as a compact data structure representing
   the complete probabilistic model of the random variables domain:

   #+begin_export latex
  \begin{definition}
  Joint-Density Factorization: Let $\mathscr{G}$ be a Bayesian Network graph over the variables X_1, ..., X_n.
  
  We say that a distribution P over the same factorization space factorizes
  according to $\mathscr{G}$ if P can be expressed as a product 

  $$P (x_1, ..., x_n) = \prod_i P(x_i | pa_i^{\mathscr{G}})$$

  This equation is called the chain rule for Bayesian networks, and the $P(x_i | pa_i^{\mathscr{G}})$ terms are
  called conditional probability distributions (CPDs).
  \end{definition}


  \begin{definition}  
  Bayesian Network: A Bayesian Network is a pair $\mathscr{B} = (\mathscr{G}, P)$ where P factorizes over $\mathscr{G}$,
  and where P is specified as a set of CPDs associated with  $\mathscr{G}$’s nodes. The distribution P is often annotated P_{\mathscr{B}}.
  \end{definition}
   #+end_export

   Given such a definition it is immediate to distinguish the three
   main puzzles that is necessary to solve when working with Bayesian
   Networks, respectively:

   #+begin_quote
   (i) the structure riddle, where you specify either by domain knowledge
   or via data-driven learning the shape of the Bayesian Network graph
   $\mathscr{G}$. Both are challenging tasks especially in the case
   the user aims to fulfill both completeness and soundness of I-maps
   as defined in cite:koller2009probabilistic

   (ii) the parameterization learning riddle, where given some
   evidence we will try to specify the parameters of the CPDs of the
   network in the most sensible way such that we well describe the
   probabilistic model of the random variables domain.

   (iii) the inference riddle, where given the network structure and
   parameterization you would apply Bayes Theorem for performing
   bidirectional inference to get to the probabilistic occurrence of
   some random variables evidence. Again a very demanding task, given
   that it was proven that the exact solution of such problem is NP-hard,
   such that it is often necessary to rely on approximate inference
   methods as in cite:pearl1987evidential or variational methods as in
   cite:jordan1999introduction.
   #+end_quote


   In this manuscript, we will focus on (ii) taking (i) as given and
   leveraging standard results from the literature as in
   cite:koller2009probabilistic for (iii).

   We turn next to a formal definition of evidence and especially of
   /uncertain evidence/ necessary for the correct outline of the
   research presented in this manuscript.
    
